app/Controllers/Auth.php

SELECT *
FROM `users`
WHERE `Email` = 'jerwinagustin200@gmail.com'
 LIMIT 1
---
    public function loginProcess()
    {
        // Get form inputs
        $email = $this->request->getPost('email');
        $password = $this->request->getPost('password');

        // Load UserModel
        $userModel = new \App\Models\UserModel();

        // Find user by email
        $user = $userModel->where('Email', $email)->first();