app/Controllers/Home.php

SELECT SUM(`Amount`) AS `Amount`
FROM `expenses`
WHERE `UserID` = '2'
AND `ExpenseDate` >= '2025-10-01'
AND `ExpenseDate` <= '2025-10-31'
---
    public function index()
    {
        // Check if user is logged in
        if (!$this->session->get('logged_in')) {
            return redirect()->to('/login');
        }

        $userId = $this->session->get('user_id');
        $currentMonth = date('Y-m-01');

        // Get wallet balance
        $walletBalance = $this->walletModel->getCurrentMonthBalance($userId);

        // Get available balance (wallet - expenses)
        $availableBalance = $this->walletModel->getAvailableBalance($userId, $currentMonth);

        // Get total expenses for current month
        $db = \Config\Database::connect();
        $builder = $db->table('expenses');
        $builder->selectSum('Amount');
        $builder->where('UserID', $userId);
        $builder->where('ExpenseDate >=', date('Y-m-01'));
        $builder->where('ExpenseDate <=', date('Y-m-t'));
        $totalExpenses = $builder->get()->getRowArray()['Amount'] ?? 0;