app/Controllers/Pages.php

SELECT `t`.*, `ec`.`CategoryName`, `ec`.`Icon`
FROM `transactions` `t`
LEFT JOIN `expense_categories` `ec` ON `ec`.`CategoryID` = `t`.`CategoryID`
WHERE `t`.`UserID` = '1'
ORDER BY `t`.`TransactionDate` DESC, `t`.`CreatedAt` DESC
---
    public function transaction()
    {
        // Check if user is logged in
        if (!$this->session->get('logged_in')) {
            return redirect()->to('/login');
        }

        $userId = $this->session->get('user_id');
        $currentMonth = date('Y-m-01');

        // Get available balance
        $availableBalance = $this->walletModel->getAvailableBalance($userId, $currentMonth);

        // Get all transactions for the user
        $db = \Config\Database::connect();
        $builder = $db->table('transactions t');
        $builder->select('t.*, ec.CategoryName, ec.Icon');
        $builder->join('expense_categories ec', 'ec.CategoryID = t.CategoryID', 'left');
        $builder->where('t.UserID', $userId);
        $builder->orderBy('t.TransactionDate', 'DESC');
        $builder->orderBy('t.CreatedAt', 'DESC');
        $transactions = $builder->get()->getResultArray();

SELECT SUM(`Amount`) AS `Amount`
FROM `expenses`
WHERE `UserID` = '1'
AND `ExpenseDate` >= '2025-05-01'
AND `ExpenseDate` <= '2025-05-31'
SELECT `ec`.`CategoryID`, `ec`.`CategoryName`, `ec`.`Budget`, `ec`.`Icon`, COALESCE(SUM(e.Amount), 0) as TotalSpent
FROM `expense_categories` `ec`
LEFT JOIN `expenses` `e` ON `e`.`CategoryID` = `ec`.`CategoryID` AND `e`.`UserID` = 1 AND `e`.`ExpenseDate` >= "2025-10-01" AND `e`.`ExpenseDate` <= "2025-10-31"
WHERE `ec`.`UserID` = '1'
GROUP BY `ec`.`CategoryID`, `ec`.`CategoryName`, `ec`.`Budget`, `ec`.`Icon`
ORDER BY `ec`.`CategoryName` ASC
---
    public function report()
    {
        // Check if user is logged in
        if (!$this->session->get('logged_in')) {
            return redirect()->to('/login');
        }

        $userId = $this->session->get('user_id');
        $currentMonth = date('Y-m-01');

        // Get available balance
        $availableBalance = $this->walletModel->getAvailableBalance($userId, $currentMonth);

        // Get expense categories with spending
        $db = \Config\Database::connect();

        // Get categories with their budgets and actual spending
        $startDate = $this->request->getGet('start_date') ?? date('Y-m-01');
        $endDate = $this->request->getGet('end_date') ?? date('Y-m-t');

        $builder = $db->table('expense_categories ec');
        $builder->select('ec.CategoryID, ec.CategoryName, ec.Budget, ec.Icon, COALESCE(SUM(e.Amount), 0) as TotalSpent');
        $builder->join('expenses e', 'e.CategoryID = ec.CategoryID AND e.UserID = ' . $userId . ' AND e.ExpenseDate >= "' . $startDate . '" AND e.ExpenseDate <= "' . $endDate . '"', 'left');
        $builder->where('ec.UserID', $userId);
        $builder->groupBy('ec.CategoryID, ec.CategoryName, ec.Budget, ec.Icon');
        $builder->orderBy('ec.CategoryName', 'ASC');
        $categories = $builder->get()->getResultArray();