app/Models/ExpenseModel.php

    public function getCategoriesWithExpenses($userId, $startDate = null, $endDate = null)
    {
        $builder = $this->db->table('expense_categories');
        $builder->select('expense_categories.*, COALESCE(SUM(expenses.Amount), 0) as TotalSpent');

        if ($startDate && $endDate) {
            $builder->join(
                'expenses',
                'expenses.CategoryID = expense_categories.CategoryID
                AND expenses.UserID = expense_categories.UserID
                AND expenses.ExpenseDate >= ' . $this->db->escape($startDate) . '
                AND expenses.ExpenseDate <= ' . $this->db->escape($endDate),
                'left'
            );
        } else {
            $builder->join(
                'expenses',
                'expenses.CategoryID = expense_categories.CategoryID
                AND expenses.UserID = expense_categories.UserID',
                'left'
            );
        }

        $builder->where('expense_categories.UserID', $userId);
        $builder->groupBy('expense_categories.CategoryID');
        $builder->orderBy('expense_categories.CreatedAt', 'DESC');

        return $builder->get()->getResultArray();
---
SELECT `expense_categories`.*, COALESCE(SUM(expenses.Amount), 0) as TotalSpent
FROM `expense_categories`
LEFT JOIN `expenses` ON `expenses`.`CategoryID` = `expense_categories`.`CategoryID` AND `expenses`.`UserID` = `expense_categories`.`UserID` AND `expenses`.`ExpenseDate` >= '2025-10-01'  AND `expenses`.`ExpenseDate` <= '2025-10-31'
WHERE `expense_categories`.`UserID` = '2'
GROUP BY `expense_categories`.`CategoryID`
ORDER BY `expense_categories`.`CreatedAt` DESC