app/Models/WalletModel.php

    public function getCurrentMonthBalance($userId)
    {
        $currentMonth = date('Y-m-01');

        $wallet = $this->where('UserID', $userId)
            ->where('Month', $currentMonth)
            ->first();
---
SELECT *
FROM `wallet`
WHERE `UserID` = '2'
AND `Month` = '2025-10-01'
 LIMIT 1

    public function getWalletByMonth($userId, $month)
    {
        return $this->where('UserID', $userId)
            ->where('Month', $month)
            ->first();
---
SELECT *
FROM `wallet`
WHERE `UserID` = '1'
AND `Month` = '2025-10-01'
 LIMIT 1